SynthMurphy/Murphy_STM32/Murphy_v1.6/src/midi.c
#include <stdio.h>
#include <stdbool.h>

#include "stm32f4xx.h"
#include "stm32f4xx_conf.h"

#include "llist.h"

#include "midi.h"
#include "synth.h"

extern llist 			note_list;						// Note list
extern synth_params		params;							// Synthesizer parameters

extern bool				new_note_event;



// Start MIDI Input with USART3 and DMA1
// -------------------------------------

uint8_t* MIDI_Start()
{
	static uint8_t MIDI_buffer[MIDI_BUFFER_LENGTH];

	GPIO_InitTypeDef  	GPIO_InitStructure;
	USART_InitTypeDef 	USART_InitStructure;
	NVIC_InitTypeDef 	NVIC_InitStructure;
	DMA_InitTypeDef  	DMA_InitStructure;


	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);
	// Start USART1 clock

	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);

	// Start DMA1 Clock

	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA2, ENABLE);


	// Initialize RX Pins (USART1 TXPB7)

	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7 ;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
	GPIO_Init(GPIOB, &GPIO_InitStructure);

	// Connect the RX  pins to USART1 alternative function

	GPIO_PinAFConfig(GPIOB, GPIO_PinSource7, GPIO_AF_USART1);

	// Setup the properties of USART1

	USART_InitStructure.USART_BaudRate = 31250;												// MIDI baudrate (31250)
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;								// 8 bits data
	USART_InitStructure.USART_StopBits = USART_StopBits_1;									// 1 stop bit
	USART_InitStructure.USART_Parity = USART_Parity_No;										// No parity bit
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None; 		// No flow control
	USART_InitStructure.USART_Mode = USART_Mode_Rx; 										// RX only is enabled
	USART_Init(USART1, &USART_InitStructure);

	// Enable the USART1 RX DMA Interrupt

	NVIC_InitStructure.NVIC_IRQChannel = DMA2_Stream2_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

	// Configure the Priority Group to 2 bits

	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);

	// finally this enables the complete USART1 peripheral

		USART_Cmd(USART1, ENABLE);

		// Configure DMA to store MIDI bytes directly into PARAMETERS_buffer

		DMA_DeInit(DMA2_Stream2);

		DMA_InitStructure.DMA_Channel = DMA_Channel_4;
		DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralToMemory;
		DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)MIDI_buffer;
		DMA_InitStructure.DMA_BufferSize = (uint16_t)sizeof(MIDI_buffer);
		DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&USART1->DR;
		DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
		DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
		DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
		DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
		DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
		DMA_InitStructure.DMA_Priority = DMA_Priority_High;
		DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Disable;
		DMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_Full;
		DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;
		DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;

		DMA_Init(DMA2_Stream2, &DMA_InitStructure);

		// Enable the USART Rx DMA request

		USART_DMACmd(USART1, USART_DMAReq_Rx, ENABLE);

		// Enable the DMA RX Stream

		DMA_Cmd(DMA2_Stream2, ENABLE);


	return (MIDI_buffer);
}


uint8_t MIDI_GetNbNewBytes(uint8_t* MIDI_Buffer)
{
	static uint16_t 	dma_cpt_prev=MIDI_BUFFER_LENGTH;
	uint16_t			dma_cpt, n=0;

	// Get current DMA counter

	dma_cpt = DMA_GetCurrDataCounter(DMA2_Stream2);

	// If DMA counter has changed, compute the number of received MIDI bytes

	if (dma_cpt != dma_cpt_prev)
	{
		if (dma_cpt < dma_cpt_prev)
		{
			n = dma_cpt_prev - dma_cpt;
		}
		else
		{
			n = dma_cpt_prev - (dma_cpt - MIDI_BUFFER_LENGTH);
		}

		// Store the new DMA counter

		dma_cpt_prev = dma_cpt;
	}
	return(n);
}


void MIDI_parser(uint8_t* MIDI_buffer, uint8_t nb_MIDI_bytes)
{
	static uint8_t 	index = 0;
	static uint8_t	state = 0;

	static uint8_t	MIDI_note, MIDI_velocity;
	static uint8_t  MIDI_CC_number, MIDI_CC_value;
	static uint8_t  MIDI_PB_byte1, MIDI_PB_byte2;

	uint8_t			MIDI_byte;

	uint16_t		PB_wheel;

	// Process message

	while (nb_MIDI_bytes != 0)
	{
		// Read a new byte from the MIDI buffer

		MIDI_byte = MIDI_buffer[index];


		// Move to next byte
		if(MIDI_byte == 0xf8 || MIDI_byte == 0xfe )
		{
			if (index == (MIDI_BUFFER_LENGTH-1)) index = 0;				// Move to next MIDI byte
				else index ++;
			nb_MIDI_bytes--;
			continue;
		}//else{
		//	printf ("0x%x @index = %d\n", MIDI_byte, index);
		//}
		switch (state)
		{

			// State 0 = Starting point for a new MIDI message

			case 0 :
			{
				switch (MIDI_byte & 0xF0)
				{

					case 0x90 :														// Note ON message
					{
						state = 10;													// Next state is 10

						// printf ("note ON event\n");

						if (index == (MIDI_BUFFER_LENGTH-1)) index = 0;				// Move to next MIDI byte
						else index ++;
						nb_MIDI_bytes--;

						break;
					}


					case 0x80 :														// Note OFF message
					{
						state = 20;													// Next state is 20

						 //printf ("note OFF event\n");

						if (index == (MIDI_BUFFER_LENGTH-1)) index = 0;				// Move to next MIDI byte
						else index ++;
						nb_MIDI_bytes--;

						break;
					}

					case 0xB0 :														// CC message
					{
						state = 30;													// Next state is 30

						 //printf ("CC event\n");

						if (index == (MIDI_BUFFER_LENGTH-1)) index = 0;				// Move to next MIDI byte
						else index ++;
						nb_MIDI_bytes--;

						break;
					}

					case 0xE0 :														// Pitch Bend message
					{
						state = 40;													// Next state is 40

						// printf ("PB event\n");

						if (index == (MIDI_BUFFER_LENGTH-1)) index = 0;				// Move to next MIDI byte
						else index ++;
						nb_MIDI_bytes--;

						break;
					}


					default :														// Other type of message, move to next byte but stays in state 0
					{
						if (index == (MIDI_BUFFER_LENGTH-1)) index = 0;				// Move to next MIDI byte
						else index ++;
						nb_MIDI_bytes--;

						break;
					}
				}

				break;
			}


			// State 10 & 11 : Note ON command

			case 10 :
			{
				if (MIDI_byte>0x7F)												// If the following byte is not a note number
				{
					state = 0;													// Return to state 0 without moving to next byte
				}

				else
				{
					MIDI_note = MIDI_byte;										// Save MIDI note

					if (index == (MIDI_BUFFER_LENGTH-1)) index = 0;				// Move to next MIDI byte
					else index ++;
					nb_MIDI_bytes--;

					state = 11;													// Next state is 11
				}

				break;
			}

			case 11 :
			{
				MIDI_velocity = MIDI_byte;										// Save MIDI velocity

				if (index == (MIDI_BUFFER_LENGTH-1)) index = 0;					// Move to next MIDI byte
				else index ++;
				nb_MIDI_bytes--;

				state = 10;														// Next state is 10

				if (MIDI_velocity > 0)
				{
					//printf ("Note ON : %d %d\n", MIDI_note, MIDI_velocity);
					if(!note_exists(note_list, MIDI_note))
					{
						note_list = add_note_last(note_list, MIDI_note, MIDI_velocity);
					}else{

						change_note_state(note_list, MIDI_note,1);
					}

					new_note_event = 1;
				}
				else
				{
					//printf ("Note OFF 1: %d %d\n", MIDI_note, MIDI_velocity);
					change_note_state(note_list, MIDI_note,4);
				}


				break;
			}

			// State 20 & 21 : Note OFF command

			case 20 :
			{
				if (MIDI_byte>0x7F)												// If the following byte is not a note number
				{
					state = 0;													// Return to state 0 without moving to next byte
				}

				else
				{
					MIDI_note = MIDI_byte;										// Save MIDI note

					if (index == (MIDI_BUFFER_LENGTH-1)) index = 0;				// Move to next MIDI byte
					else index ++;
					nb_MIDI_bytes--;

					state = 21;													// Next state is 21
				}

				break;
			}

			case 21 :
			{
				MIDI_velocity = MIDI_byte;										// Save MIDI velocity

				if (index == (MIDI_BUFFER_LENGTH-1)) index = 0;					// Move to next MIDI byte
				else index ++;
				nb_MIDI_bytes--;

				state = 20;														// Next state is 20

				//printf ("Note OFF 2: %d %d\n", MIDI_note, MIDI_velocity);
				change_note_state(note_list, MIDI_note,4);


				break;
			}


			// State 30 & 31 : CC command

			case 30 :
			{
				if (MIDI_byte>0x7F)												// If the following byte is not a CC number
				{
					state = 0;													// Return to state 0 without moving to next byte
				}

				else
				{
					MIDI_CC_number = MIDI_byte;									// Save MIDI CC number

					if (index == (MIDI_BUFFER_LENGTH-1)) index = 0;				// Move to next MIDI byte
					else index ++;
					nb_MIDI_bytes--;

					state = 31;													// Next state is 31
				}

				break;
			}

			case 31 :
			{
				MIDI_CC_value = MIDI_byte;										// Save MIDI velocity

				if (index == (MIDI_BUFFER_LENGTH-1)) index = 0;					// Move to next MIDI byte
				else index ++;
				nb_MIDI_bytes--;

				state = 30;														// Next state is 30
				if (MIDI_CC_value == 127)
					params.pedal=1;
				else
					params.pedal=0;
				//printf ("CC : %d %d\n", MIDI_CC_number, MIDI_CC_value);
			//	ChangeParam(MIDI_CC_number, MIDI_CC_value);
			//	params.bend = (float_t)MIDI_CC_value ;
			//	if(MIDI_CC_number == 64 )
				//	params.detune = 1.0f + 0.0004f*(MIDI_CC_value-64);
				break;
			}



			// State 40 & 41 : Pitch Bend message

			case 40 :
			{
				if (MIDI_byte > 0x7F)												// If following byte is note a PB value
				{
					state = 0;													// Return to state 0
				}

				else
				{
					MIDI_PB_byte1 = MIDI_byte;									// Save MIDI CC number

					if (index == (MIDI_BUFFER_LENGTH-1)) index = 0;				// Move to next MIDI byte
					else index ++;
					nb_MIDI_bytes--;

					state = 41;													// Next state is 41
				}

				break;
			}

			case 41 :
			{
				MIDI_PB_byte2 = MIDI_byte;										// Save MIDI velocity

				if (index == (MIDI_BUFFER_LENGTH-1)) index = 0;					// Move to next MIDI byte
				else index ++;
				nb_MIDI_bytes--;

				PB_wheel = (uint8_t) MIDI_PB_byte2;
				PB_wheel <<=7;
				PB_wheel |= (uint8_t) MIDI_PB_byte1;

				// printf ("PB : %x\n", PB_wheel);

			//params.bend = params.pitch * 2.0f * ( (float_t)PB_wheel - 8192.0f) / (4096.0f * 12.0f);

				state = 40;														// Next state is 00

				break;
			}

		}
	}





}
